{
  "updatedAt": "2026-02-05T16:50:11.551813",
  "insight": {
    "title": "How money is created out of thin air",
    "subtitle": "Why banks can create money when they lend",
    "readingTime": 5,
    "sections": [
      {
        "type": "paragraph",
        "text": "Most people believe banks lend out money that already exists.They imagine banks as vaults — taking deposits from savers and handing that same money to borrowers."
      },
      {
        "type": "paragraph",
        "text": "That intuition feels natural. It’s also wrong."
      },
      {
        "type": "heading",
        "text": "The surprising truth"
      },
      {
        "type": "paragraph",
        "text": "In modern economies, most money is created when banks issue loans.When a bank approves your loan, it does not transfer existing money from someone else’s account."
      },
      {
        "type": "paragraph",
        "text": "Instead, it creates new money digitally by crediting your account with a deposit. Money appears — not from printing presses, but from accounting entries."
      },
      {
        "type": "heading",
        "text": "Why this matters"
      },
      {
        "type": "paragraph",
        "text": "Because money is created through lending, economies are highly sensitive to interest rates and financial confidence."
      },
      {
        "type": "heading",
        "text": "The takeaway"
      },
      {
        "type": "paragraph",
        "text": "Money is not a fixed pool. It expands and contracts based on trust, rules, and incentives."
      }
    ]
  },
  "news": [
    {
      "title": "'Lowered my testosterone levels,' reveals Imane Khelif, Paris 2024 gold-winning controversial boxer",
      "description": "Khelif was at the centre of gender row in Paris Olympics 2024 after beating Italian Angela Carini in just 46 second during the opening bout. She, however, went on to put the noise aside and came out a gold medal winner after IOC put aside IBA's decision of declaring her ineligible.",
      "source": "WION",
      "url": "https://www.wionews.com/sports/-lowered-my-testosterone-levels-reveals-imane-khelif-paris-2024-gold-winning-controversial-boxer-1770266056629",
      "category": "General",
      "readingTime": 2
    },
    {
      "title": "HP, Dell, Acer and Asus mull using Chinese memory chips amid supply crunch, Nikkei Asia reports",
      "description": "PC makers HP, Dell, Acer and Asus are considering sourcing memory chips from Chinese chipmakers for the first time amid a global supply crunch that is threatening product launches and pushing up costs...",
      "source": "marketscreener.com",
      "url": "https://www.marketscreener.com/news/hp-dell-acer-and-asus-mull-using-chinese-memory-chips-amid-supply-crunch-nikkei-asia-reports-ce7e5adbd88ef526",
      "category": "General",
      "readingTime": 2
    },
    {
      "title": "Mars Rover Can't Escape AI Even On A Whole Separate Planet",
      "description": "Driving the rover remotely in real time isn't possible due to the vast distance between the planets.",
      "source": "Jalopnik",
      "url": "https://www.jalopnik.com/2092323/mars-rover-escape-ai/",
      "category": "General",
      "readingTime": 2
    },
    {
      "title": "Man surrenders to police after fatally attacking woman with poisonous arrow in Baringo",
      "description": "The suspect claimed that the deceased mistreated his wife",
      "source": "the-star.co.ke",
      "url": "https://www.the-star.co.ke/news/2026-02-05-man-surrenders-to-police-after-fatally-attacking-woman-with-poisonous-arrow-in-kinyach-baringo",
      "category": "General",
      "readingTime": 2
    },
    {
      "title": "Valve Steam Machine and Frame Hit by Memory Crisis",
      "description": "When Valve announced the Steam Machine, Steam Frame, and updated Steam Controller late in 2025, it did not reveal pricing, but the gaming giant said that the hardware would launch in early 2026. That launch window is still on the cards, but according to a recent announcement by Valve, it is still un...",
      "source": "TechPowerUp",
      "url": "https://www.techpowerup.com/345989/valve-steam-machine-and-frame-hit-by-memory-crisis",
      "category": "General",
      "readingTime": 2
    },
    {
      "title": "Sources: Warriors trading Jonathan Kuminga, Buddy Hield to Hawks for Kristaps Porzingis",
      "description": "The Warriors are trading Jonathan Kuminga and Buddy Hield to the Hawks for Kristaps Porzingis, sources told ESPN, unofficially putting an end to Golden State's pursuit of Giannis Antetokounmpo.",
      "source": "ESPN",
      "url": "https://www.espn.com.au/nba/story/_/id/47834519/warriors-trading-jonathan-kuminga-buddy-hield-hawks-kristaps-porzingis",
      "category": "General",
      "readingTime": 2
    },
    {
      "title": "165,000-classroom backlog: DepEd taps LGUs to speed up school infrastructure",
      "description": "The Department of Education (DepEd) on Thursday, February 5, highlighted a new decentralized strategy to address the country’s growing classroom shortage by...",
      "source": "Manila Bulletin",
      "url": "https://mb.com.ph/2026/02/05/165000-classroom-backlog-deped-taps-lgus-to-speed-up-school-infrastructure",
      "category": "General",
      "readingTime": 2
    },
    {
      "title": "AEW Dynamite Results: February 4, 2026 - Brody King Earns AEW World Title Shot, Andrade vs. Hangman at AEW Grand Slam Australia, More",
      "description": "AEW Dynamite was LIVE from Las Vegas, Nevada, on TBS and HBO Max! And the pursuit of the AEW World Championship was once again in the spotlight just 10 days from AEW Grand Slam Australia!",
      "source": "AEW",
      "url": "https://www.allelitewrestling.com/post/aew-dynamite-results-february-4-2026",
      "category": "General",
      "readingTime": 2
    },
    {
      "title": "Rangers trade Artemi Panarin to Kings in pre-Olympic freeze deal",
      "description": "The Breadman is headed to Southern California. Artemi Panarin waived his no-move clause with the Rangers and accepted a trade to the Kings, The Post confirmed.",
      "source": "New York Post",
      "url": "https://nypost.com/2026/02/04/sports/rangers-trade-artemi-panarin-to-kings-in-pre-olympic-freeze-deal/",
      "category": "General",
      "readingTime": 2
    },
    {
      "title": "3 takeaways from No. 16 BYU’s loss to Oklahoma State",
      "description": "Make that three straight losses for BYU.",
      "source": "Deseret News",
      "url": "https://www.deseret.com/sports/2026/02/04/byu-basketball-loses-at-oklahoma-state-3-takeaways/",
      "category": "General",
      "readingTime": 2
    }
  ]
}